<!DOCTYPE html>
<html lang="es">

<head>

  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content="Los mejores consejos y consideraciones cuando quieres hacer o tener tu sitio web">
  <meta name="author" content="Devstar Novatech">
  <link rel="shortcut icon" href="../Img/postImg/logoBlog.ico">
  <title>Devstar Novatech Blog - Que necesito para hacer mi sitio web</title>

  <!-- Bootstrap core CSS -->
  <!-- <link href="vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet"> -->
  <link rel="stylesheet" href="../css/bootstrap.css">

  <!-- Custom fonts for this template -->
  <!-- <link href="vendor/fontawesome-free/css/all.min.css" rel="stylesheet" type="text/css"> -->
  <link rel="stylesheet" href="../css/font-awesome.min.css">
  <link href='https://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
  <link href='https://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/css'>

  <!-- Custom styles for this template -->
  <link href="../css/clean-blog.min.css" rel="stylesheet">
  <link rel="stylesheet" href="../css/slider.min.css">
  <link rel="stylesheet" href="../css/main.css">

</head>

<body>

  <!-- Navigation -->
  <nav class="navbar navbar-expand-lg navbar-light fixed-top" id="mainNav">
    <div class="container">
      <a class="navbar-brand" href="http://devstar-novatech.com/">Devstar Novatech</a>
      <button class="navbar-toggler navbar-toggler-right" type="button" data-toggle="collapse" data-target="#navbarResponsive" aria-controls="navbarResponsive" aria-expanded="false" aria-label="Toggle navigation">
        Men&uacute;
        <i class="fa fa-bars"></i>
      </button>
      <div class="collapse navbar-collapse" id="navbarResponsive">
        <ul class="navbar-nav ml-auto">
          <li class="nav-item">
            <a class="nav-link" href="../Blog.html">Inicio</a>
          </li>
          <li class="nav-item">
            <a class="nav-link" href="../aboutBlog.html">Acerca de</a>
          </li>
          <li class="nav-item">
            <a class="nav-link" href="../blog.html#publicaciones">Posts</a>
          </li>
          <li class="nav-item">
            <a class="nav-link" href="../contactblog.php">Contacto</a>
          </li>
        </ul>
      </div>
    </div>
  </nav>

  <!-- Page Header -->
  <header class="masthead" style="background-image: url('../Img/postImg/hosting-servidores.jpg')">
    <div class="overlay"></div>
    <div class="container">
      <div class="row">
        <div class="col-lg-8 col-md-10 mx-auto">
          <div class="post-heading">
            <h1>¿Que necesito para tener mi sitio web?</h1>
            <h2 class="subheading">Consideraciones y material necesario antes de crear tu sitio web</h2>
            <span class="meta">Publicado por
              <a href="http://devstar-novatech.com/">Devstar Novatech</a>
              el 26 de febrero de 2021</span>
          </div>
        </div>
      </div>
    </div>
  </header>

  <!-- Post Content -->
  <article>
    <div class="container">
      <div class="row">
        <div class="col-lg-8 col-md-10 mx-auto">

          <p class="text-justify">Es probablemente la primera pregunta que se plantea todo emprendedor. Despu&eacute;s de todo, el sitio web de tu negocio es la imagen que vas a dar a tus clientes. Por lo tanto, es muy importante que contemples todos los detalles para que tu proyecto se materialice a tu gusto.</p>

          <p class="text-justify">En esta entrada, te mostraremos los puntos clave para que puedas iniciar con tu sitio web:</p>

          <p class="text-justify">
            <ul>
              <li class="text-justify">Objetivo.</li>
              <li class="text-justify">Nombre y hosting.</li>
              <li class="text-justify">Material e informaci&oacute;n de tu negocio.</li>
              <li class="text-justify">Dise&ntilde;o web.</li>
              <li class="text-justify">Programaci&oacute;n y mantenimiento.</li>
              <li class="text-justify">Monitoreo estad&iacute;stico.</li>
            </ul>  
          </p>

          <p class="text-justify">Cada aspecto es muy importante y te ayudar&aacute; a sacar ventaja de las herramientas que elijas, ya sea si lo haces t&uacute; mismo, utilizas alg&uacute;n generador de sitios web o si le pides apoyo a un experto.
          </p>

          <p class="text-justify">A continuaci&oacute;n te presentamos los puntos m&aacute;s importantes a considerar para generar tu sitio web.</p>
          
          <h2 class="section-heading">¡Proponte un objetivo!</h2>

          <p class="text-justify">Antes de todo tienes que pensar en el objetivo del sitio web y de lo que le quieres transmitir al cliente, por ejemplo: los servicios que ofreces y porque deber&iacute;a de contratarte, el fin de esto es orientar y motivar al cliente. Planea minuciosamente tu identidad como marca, porque en estos tiempos tener un sitio web es imprescindible para cualquier persona, marca o negocio.</p>

          <h2 class="section-heading">Necesitas un nombre</h2>

          <p class="text-justify">&Eacute;ste te identificar&aacute; en la red y por lo tanto, necesitas que te identifique. El nombre es el que conocemos como dominio, y consta de nombre y extensi&oacute;n la cual puede ser .com, .net. org, etc. Tambi&eacute;n la extensi&oacute;n puede tener tu c&oacute;digo de pa&iacute;s por ejemplo .mx (M&eacute;xico), .ar (Argentina), .pe (Per&uacute;), etc. Una vez que hayas elegido la extensi&oacute;n de tu dominio tienes que registrarlo. En Devstar Novatech te ofrecemos diferentes extensiones y te asesoramos en el proceso para saber si el nombre que deseas se encuentra disponible, puedes contactarnos haciendo <a href="../contactblog.php">click aqu&iacute;</a>. El registro se puede contratar a partir de un a&ntilde;o en adelante.</p>

          <!-- <blockquote class="blockquote">The dreams of yesterday are the hopes of today and the reality of tomorrow. Science has not yet mastered prophecy. We predict too much for the next year and yet far too little for the next ten.</blockquote> -->

          <h2 class="section-heading">Hosting</h2>

          <p class="text-justify">Es donde se va a almacenar la informaci&oacute;n de tu sitio web, es un servicio de alojamiento que proveer el espacio en internet para los sitios web, generalmente un servicio de hosting incluye otros servicios tales como:</p>

          <p class="text-justify">
            <ul>
              <li class="text-justify">Un servidor de correo electr&oacute;nico que permite que tengas cuentas de correo con tu propio nombre de dominio.</li>
              <li class="text-justify">Alojamiento de aplicaciones web pasadas en PHP y bases de datos para crear webs generalistas, blogs, tiendas online o foros de discusi&oacute;n, por citar algunas de las aplicaciones m&aacute;s importantes.</li>
              <li class="text-justify">Acceso v&iacute;a FTP para almacenar y descargar ficheros.</li>
              <li class="text-justify">Crear discos virtuales, es decir, crear almacenamiento en la nube con tu propio servicio de hosting al que accedes como si lo tuvieras en tu computadora.</li>
            </ul>  
          </p>

          <h2 class="section-heading">¡El material e informaci&oacute;n es importante!</h2>

          <p class="text-justify">Antes de que comiences con la creaci&oacute;n del sitio web, es importante que tengas <b>TODO</b> el contenido que quieres incluir en el, para evitar que tu sitio quede &ldquo;a medias&rdquo;, adem&aacute;s que tengas que hacer o pagar por una actualizaci&oacute;n y lo mas importante, que el tiempo de desarrollo sea menor y poder empezar a disfrutar de las ventajas de un sitio web lo antes posible:</p>

          <p class="text-justify">
            <ul>
              <li class="text-justify">Logo y contenido multimeadia (im&aacute;genes, videos y audio).</li>
              <li class="text-justify">Informaci&oacute;n y textos sobre ti y tus servicios o art&iacute;culos.</li>
              <li class="text-justify">Informaci&oacute;n de contacto.</li>
              <li class="text-justify">Mapa del sitio.</li>
              <li class="text-justify">Aviso de privacidad.</li>
              <li class="text-justify">T&eacute;rminos y condiciones.</li>
            </ul>  
          </p>

          <p class="text-justify">Sino cuentas con alguno o varios de los puntos anteriores, nosotros te podemos ayudar, cont&aacute;ctanos <a href="../contactblog.php">aqu&iacute;</a>.</p>

          <h2 class="section-heading">Dise&ntilde;o Web</h2>

          <p class="text-justify">B&aacute;sicamente consiste en la creaci&oacute;n de un dise&ntilde;o y la maquetaci&oacute;n de los textos, im&aacute;genes, v&iacute;deos y sonido, para hacer tu sitio web atractivo, intuitivo y f&aacute;cil de comprender. Esto no es una tarea f&aacute;cil, pero siempre puedes consultar la web y encontrar material sobre c&oacute;mo hacerlo o buscar  los servicios de profesionales en Devstar Novatech te ofrecemos nuestros servicios para que tengas una web profesional y atractiva.</p>

          <h2 class="section-heading">Programaci&oacute;n</h2>

          <p class="text-justify">Si planeas hacer t&uacute; mismo el sitio web puedes ayudarte de un sistema de gesti&oacute;n de contenido (CMS), estas herramientas ofrecen integraci&oacute;n con diferentes aplicaciones y sistemas, adem&aacute;s de ser muy f&aacute;cil de administrar para las empresas, sin tener que depender de su &aacute;rea de sistemas o de proveedores externos.</p>
          <p>Sin embargo si quieres evitar esta situaci&oacute;n, ahorrar tiempo y tener un sitio web profesional, puedes <a href="">contactarnos</a> ofrecemos servicios agiles de implementaci&oacute;n para que puedas tener tu sitio web.</p>

          <!-- <a href="#">
            <img class="img-fluid" src="../Img/postImg/post-sample-image.jpg" alt="">
          </a>
          <span class="caption text-muted">To go places and do things that have never been done before – that’s what living is all about.</span> -->

          <h2 class="section-heading">Mantenimiento</h2>

          <p class="text-justify">A un sitio web debe d&aacute;rsele mantenimiento y actualizaci&oacute;n constante, imagina que es como un coche que tiene que estar a punto para su correcto funcionamiento, esta tarea de igual forma puedes realizarla tu o contratar los servicios profesionales de alguna empresa o persona especialista.</p>

          <h2 class="section-heading">Google Analytics</h2>

          <p class="text-justify">Afortunadamente, una de las herramientas esenciales para todo due&ntilde;o de un sitio web es completamente gratuita. La herramienta te da valiosa informaci&oacute;n demogr&aacute;fica y te dice, entre otras cosas, cu&aacute;nta gente visita tu sitio, c&oacute;mo llegaron a &eacute;l y si lo visitaron m&aacute;s de una vez.</p>

          <p class="text-justify">La informaci&oacute;n que obtengas de Google Analytics te ayudar&aacute; a saber si tu campa&ntilde;a de marketing est&aacute; funcionando; y qu&eacute; t&aacute;cticas est&aacute;n teniendo los mejores resultados. La herramienta te dir&aacute; tambi&eacute;n qu&eacute; cambios hacerle a tu sitio y campa&ntilde;a de marketing para alcanzar m&aacute;s r&aacute;pido tus metas.</p>

          <p class="text-justify">Construir un sitio web tiene sus complicaciones; pero una vez que est&eacute;s consciente de los pasos b&aacute;sicos que tendr&aacute;s que dar, ser&aacute; m&aacute;s f&aacute;cil elaborar un plan a futuro. Claro; te enfrentar&aacute;s a nuevos retos a&uacute;n cuando ya hayas lanzado tu sitio; pero todo valdr&aacute; la pena cuando veas que tu sitio despega y aumenta el n&uacute;mero de visitas. Si hasta ahora no hab&iacute;as empezado porque no sab&iacute;as qu&eacute; hacer, espero este art&iacute;culo te haya sido de utilidad. ¡Buena suerte!</p>

          <div class="">
            <div class="d-flex justify-content-center"><p class="h3">¿Tienes alguna duda o comentario?</p></div>
            <div class="d-flex justify-content-center">
              <a class="btn btn-outline-dark rounded mt-2" href="../contactblog.php"><b>Contacto</b></a>
            </div>
          </div>
          <!-- <p>Placeholder text by
            <a href="http://spaceipsum.com/">Space Ipsum</a>. Photographs by
            <a href="https://www.flickr.com/photos/nasacommons/">NASA on The Commons</a>.
          </p> -->
        </div>
      </div>
    </div>
  </article>

  <hr>

  <!-- Footer -->
  <footer>
    <div class="container">
      <div class="row">
        <div class="col-lg-8 col-md-10 mx-auto">
          <ul class="list-inline text-center">
            <li class="list-inline-item">
              <a href="http://devstar-novatech.com/">
                <span class="fa-stack fa-2x">
                  <!-- <i class="fas fa-circle fa-stack-2x"></i>
                  <i class="fab fa-twitter fa-stack-1x fa-inverse"></i> -->
                  <i class="fa fa-facebook-official" aria-hidden="true"></i>
                </span>
              </a>
            </li>
            <li class="list-inline-item">
              <a href="http://devstar-novatech.com/">
                <span class="fa-stack fa-2x">
                  <!-- <i class="fas fa-circle fa-stack-2x"></i>
                  <i class="fab fa-facebook-f fa-stack-1x fa-inverse"></i> -->
                  <i class="fa fa-twitter" aria-hidden="true"></i>
                </span>
              </a>
            </li>
            <li class="list-inline-item">
              <a href="http://devstar-novatech.com/">
                <span class="fa-stack fa-2x">
                  <!-- <i class="fas fa-circle fa-stack-2x"></i>
                  <i class="fab fa-github fa-stack-1x fa-inverse"></i> -->
                  <i class="fa fa-instagram" aria-hidden="true"></i>
                </span>
              </a>
            </li>
          </ul>
          <p class="copyright text-muted">Copyright &copy; Devstar Novatech 2021</p>
        </div>
      </div>
    </div>
  </footer>

  <!-- Bootstrap core JavaScript -->
  <script src="../js/jquery.min.js"></script>
  <script src="../js/popper.min.js"></script>
  <script src="../js/bootstrap.min.js"></script>
  <!-- Custom scripts for this template -->
  <script src="../js/clean-blog.min.js"></script>
  <script src="../js/scrollreveal.min.js"></script>

</body>

</html>
